package common.commands;

import common.supplier.Supply;

public class HelpCommand implements Command{

    @Override
    public void execute(Supply s) {
        // if(s.getPeremen().equals(""))
        // System.out.println("help : вывести справку по доступным командам\n" +
        //         "info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)\n" +
        //         "show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении\n" +
        //         "add {element} : добавить новый элемент в коллекцию\n" +
        //         "update id {element} : обновить значение элемента коллекции, id которого равен заданному\n" +
        //         "remove_by_id id : удалить элемент из коллекции по его id\n" +
        //         "clear : очистить коллекцию\n" +
        //         "save : сохранить коллекцию в файл\n" +
        //         "execute_script file_name : считать и исполнить скрипт из указанного файла. В скрипте содержатся команды в таком же виде, в котором их вводит пользователь в интерактивном режиме.\n" +
        //         "exit : завершить программу (без сохранения в файл)\n" +
        //         "add_if_max {element} : добавить новый элемент в коллекцию, если его значение превышает значение наибольшего элемента этой коллекции\n" +
        //         "remove_lower {element} : удалить из коллекции все элементы, меньшие, чем заданный\n" +
        //         "history : вывести последние 5 команд (без их аргументов)\n" +
        //         "remove_all_by_engine_power enginePower : удалить из коллекции все элементы, значение поля enginePower которого эквивалентно заданному\n" +
        //         "average_of_engine_power : вывести среднее значение поля enginePower для всех элементов коллекции\n" +
        //         "print_unique_fuel_consumption : вывести уникальные значения поля fuelConsumption всех элементов в коллекции");
        // else System.out.println("Команда введена некорректно");
    }

    @Override
    public void declare(Supply s){
        if(s.getPeremen().equals(""))
        System.out.println("help : вывести справку по доступным командам\n" +
                "info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)\n" +
                "show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении\n" +
                "add {element} : добавить новый элемент в коллекцию\n" +
                "update id {element} : обновить значение элемента коллекции, id которого равен заданному\n" +
                "remove_by_id id : удалить элемент из коллекции по его id\n" +
                "clear : очистить коллекцию\n" +
                "save : сохранить коллекцию в файл\n" +
                "execute_script file_name : считать и исполнить скрипт из указанного файла. В скрипте содержатся команды в таком же виде, в котором их вводит пользователь в интерактивном режиме.\n" +
                "exit : завершить программу (без сохранения в файл)\n" +
                "add_if_max {element} : добавить новый элемент в коллекцию, если его значение превышает значение наибольшего элемента этой коллекции\n" +
                "remove_lower {element} : удалить из коллекции все элементы, меньшие, чем заданный\n" +
                "history : вывести последние 5 команд (без их аргументов)\n" +
                "remove_all_by_engine_power enginePower : удалить из коллекции все элементы, значение поля enginePower которого эквивалентно заданному\n" +
                "average_of_engine_power : вывести среднее значение поля enginePower для всех элементов коллекции\n" +
                "print_unique_fuel_consumption : вывести уникальные значения поля fuelConsumption всех элементов в коллекции");
        else System.out.println("Команда введена некорректно");
    }
    public String getName() {
        return "help";
    }

}
